tutorials/rigidBodyAndBeam/0/beam/pointW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           pointVectorField;
    location        "0/beam";
    object          pointW;
}

dimensions      [ 0 1 0 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
